Autodesk.Navisworks.Api.Cursor
Enumerates cursors used in input into Navisworks

Autodesk.Navisworks.Api.Cursor.Unhandled
Special case. Returned by GetCursor() if handled already.

Autodesk.Navisworks.Api.Cursor.Handled
Handled Cursor.

Autodesk.Navisworks.Api.Cursor.Walk
Walk Cursor.

Autodesk.Navisworks.Api.Cursor.Fly
Fly Cursor.

Autodesk.Navisworks.Api.Cursor.Orbit
Orbit Cursor.

Autodesk.Navisworks.Api.Cursor.Swivel
Swivel Cursor.

Autodesk.Navisworks.Api.Cursor.Examine
Examine Cursor.

Autodesk.Navisworks.Api.Cursor.Pan
Pan Cursor.

Autodesk.Navisworks.Api.Cursor.Zoom
Zoom Cursor.

Autodesk.Navisworks.Api.Cursor.Turntable
Turntable Cursor.

Autodesk.Navisworks.Api.Cursor.Focus
Focus Cursor.

Autodesk.Navisworks.Api.Cursor.Application
Application Cursor.

Autodesk.Navisworks.Api.Cursor.ZoomBox
ZoomBox Cursor.

Autodesk.Navisworks.Api.Cursor.Measure
Measure Cursor.

Autodesk.Navisworks.Api.Cursor.HyperHand
HyperHand Cursor.

Autodesk.Navisworks.Api.Cursor.PanWorld
PanWorld Cursor.

Autodesk.Navisworks.Api.Cursor.Roll
Roll Cursor.

Autodesk.Navisworks.Api.Cursor.Stop
Stop Cursor.

Autodesk.Navisworks.Api.Cursor.MeasureEdge
MeasureEdge Cursor.

Autodesk.Navisworks.Api.Cursor.MeasureVertex
MeasureVertex Cursor.

Autodesk.Navisworks.Api.Cursor.Redline
Redline Cursor.

Autodesk.Navisworks.Api.Cursor.Erase
Erase Cursor.

Autodesk.Navisworks.Api.Cursor.Wheel
Wheel Cursor.

Autodesk.Navisworks.Api.Cursor.MarkupSelection
Markup Selection Cursor.

Autodesk.Navisworks.Api.Cursor.MarkupSnapping
Markup Snapping Cursor.

Autodesk.Navisworks.Api.Cursor.MarkupEraser
Markup Eraser Cursor.

Autodesk.Navisworks.Api.Cursor.MarkupQuickPick
Markup QuickPick Cursor.

Autodesk.Navisworks.Api.Cursor.MarkupBucket
Markup Bucket Cursor.

Autodesk.Navisworks.Api.Cursor.MarkupAutoPoly
Markup AutoPoly Cursor.